Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
#include "DataSpace.h"

#include <iostream>

#include "../utils/bitMacros.h"
#include "StreamUtils.h"
#include "DataUtils.h"

#include "../ATmega32u4.h"
#include "../extras/Debugger.h"

#define LU_MODULE "DataSpace"


void A32u4::DataSpace::LastSet::resetAll() {
	EECR_EEMPE = 0;
	PLLCSR_PLLE = 0;
	ADCSRA_ADSC = 0;
	Timer0Update = 0;
	Timer3Update = 0;
}

bool A32u4::DataSpace::LastSet::operator==(const LastSet& other) const{
#define _CMP_(x) (x==other.x)
	return _CMP_(EECR_EEMPE) && _CMP_(PLLCSR_PLLE) && _CMP_(ADCSRA_ADSC) && 
	_CMP_(Timer0Update) && _CMP_(Timer3Update);
#undef _CMP_
}

size_t A32u4::DataSpace::LastSet::sizeBytes() const {
	size_t sum = 0;
	sum += sizeof(EECR_EEMPE);
	sum += sizeof(PLLCSR_PLLE);
	sum += sizeof(ADCSRA_ADSC);
	sum += sizeof(Timer0Update);
	sum += sizeof(Timer3Update);
	return sum;
}
uint32_t A32u4::DataSpace::LastSet::hash() const noexcept{
	uint32_t h = 0;
	DU_HASHC(h,EECR_EEMPE);
	DU_HASHC(h,PLLCSR_PLLE);
	DU_HASHC(h,ADCSRA_ADSC);
	DU_HASHC(h,Timer0Update);
	DU_HASHC(h,Timer3Update);
	return h;
}

// ##### DataSpace #####

A32u4::DataSpace::DataSpace(ATmega32u4* mcu) : mcu(mcu), 
#if MCU_USE_HEAP
data(new uint8_t[Consts::data_size]), eeprom(new uint8_t[Consts::eeprom_size])
#endif
{
#if 1
	std::memset(data, 0, Consts::data_size);
	std::memset(eeprom, 0, Consts::eeprom_size);
#endif
}

A32u4::DataSpace::~DataSpace() {
#if MCU_USE_HEAP
	delete[] data;
	delete[] eeprom;
#endif
}

A32u4::DataSpace::DataSpace(const DataSpace& src): 
#if MCU_USE_HEAP
data(new uint8_t[Consts::data_size]), eeprom(new uint8_t[Consts::eeprom_size])
#endif
{
	operator=(src);
}
A32u4::DataSpace& A32u4::DataSpace::operator=(const DataSpace& src){
	std::memcpy(data, src.data, Consts::data_size);
	std::memcpy(eeprom, src.eeprom, Consts::eeprom_size);

	std::memcpy(sreg, src.sreg, 8);

	lastSet = src.lastSet;

	return *this;
}

void A32u4::DataSpace::reset() {
	resetIO();
	lastSet.resetAll();

	std::memset(sreg, 0, 8); // reset sreg cache
}
void A32u4::DataSpace::resetIO() {
	//add: set all IO Registers to initial Values
	for (size_t i = 0; i < Consts::io_size; i++) {
		data[Consts::io_start + i] = 0;
	}
	for (size_t i = 0; i < Consts::ext_io_size; i++) {
		data[Consts::ext_io_start + i] = 0;
	}
	for (size_t i = 0; i < Consts::eeprom_size; i++) {
		eeprom[i] = 0;
	}

	setSP(Consts::SP_initaddr);
}

void A32u4::DataSpace::doTicks(uint8_t num) {
	if (isBitSetNB(data[Consts::PRR0], 5)) {
		return;
	}

	const uint8_t timer0 = data[Consts::TCNT0];
	const uint8_t timer0plus = timer0 + num;
	if (timer0plus < timer0) {
		mcu->dataspace.data[Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
		//printf("OVERFLOW at %llu\n", mcu->cpu.totalCycls);
	}
	data[Consts::TCNT0] = timer0plus;


	markTimer0Update();
}
void A32u4::DataSpace::updateTimers(){
	if (!isBitSetNB(data[Consts::PRR0], Consts::PRR0_PRTIM0)) {
		const uint32_t addAmt = (mcu->cpu.totalCycls - lastSet.Timer0Update) / getTimer0PrescDiv();
		if(addAmt > 0) {
			const uint8_t timer0 = data[Consts::TCNT0];
			const uint8_t timer0Next = timer0 + addAmt;
			if(timer0Next < timer0 || addAmt >= 256) { // overflow
				data[Consts::TIFR0] |= (1 << Consts::TIFR0_TOV0); // set TOV0 in TIFR0
			}
			data[Consts::TCNT0] = timer0Next;
			markTimer0Update();
		}
	}
	if (!isBitSetNB(data[Consts::PRR1], Consts::PRR1_PRTIM3) && (data[Consts::TIMSK3] & (1 << Consts::TIMSK3_OCIE3A))) {
		const uint32_t addAmt = (mcu->cpu.totalCycls - lastSet.Timer3Update) / getTimer3PrescDiv();
		if(addAmt > 0) {
			const uint16_t timer3 = getWordRegRam_(Consts::TCNT3L);
			const uint16_t timer3Next = timer3 + addAmt;
			const uint16_t target = getWordRegRam_(Consts::OCR3AL);

			bool matchesA = false;
			if(addAmt >= 0x10000) {
				matchesA = true;
			}else{
				if(timer3 <= timer3Next) {
					if(timer3 <= target && target <= timer3Next)
						matchesA = true;
				}else{
					if(timer3 <= target || target <= timer3Next)
						matchesA = true;
				}
			}

			if(matchesA) {
				data[Consts::TIFR3] |= (1 << Consts::TIFR3_OCF3A);
				Timer3ATriggered = true;
			} else{
				Timer3ATriggered = false;
			}
			setWordRegRam_(Consts::TCNT3L, timer3Next);
			markTimer3Update();
		}
	}
	checkForIntr();
}

void A32u4::DataSpace::checkForIntr() {
	if(!sreg[Consts::SREG_I]) // check if interrupts are disabled
		return;

	if (data[Consts::TIFR0] & (1 << Consts::TIFR0_TOV0)) {
		if (data[Consts::TIMSK0] & (1 << Consts::TIMSK0_TOIE0)) {
			//mcu->cpu.queueInterrupt(23); // 0x2E timer0 overflow interrupt vector
			data[Consts::TIFR0] &= ~(1 << Consts::TIFR0_TOV0);
			mcu->cpu.directExecuteInterrupt(23);
		}
	}

#if 0 // not needed atm
	if (data[Consts::TIFR3] & (1 << Consts::TIFR3_TOV3)) {
		if (data[Consts::TIMSK3] & (1 << Consts::TIMSK3_TOIE3)) {
			data[Consts::TIFR3] &= ~(1 << Consts::TIFR3_TOV3);
			mcu->cpu.directExecuteInterrupt();
		}
	}
#endif
	if (data[Consts::TIFR3] & (1 << Consts::TIFR3_OCF3A)) {
		if (data[Consts::TIMSK3] & (1 << Consts::TIMSK3_OCIE3A)) {
			data[Consts::TIFR3] &= ~(1 << Consts::TIFR3_OCF3A);
			mcu->cpu.directExecuteInterrupt(32);
		}
	}
}
uint8_t A32u4::DataSpace::getTimer0Presc() const {
	return mcu->dataspace.data[DataSpace::Consts::TCCR0B] & 0b111;
}
uint8_t A32u4::DataSpace::getTimer3Presc() const {
	return mcu->dataspace.data[DataSpace::Consts::TCCR3B] & 0b111;
}
uint16_t A32u4::DataSpace::getTimer0PrescDiv() const {
	return DataSpace::timerPresc[getTimer0Presc()];
}
uint16_t A32u4::DataSpace::getTimer3PrescDiv() const {
	return DataSpace::timerPresc[getTimer3Presc()];
}
void A32u4::DataSpace::markTimer0Update() { 
	// functions is supposed to set lastTimer0Update to the exact technically correct value, even if we are already past that
	uint64_t diff = mcu->cpu.totalCycls - lastSet.Timer0Update;
	diff = (diff / getTimer0PrescDiv()) * getTimer0PrescDiv();
	lastSet.Timer0Update += diff;
}
void A32u4::DataSpace::markTimer3Update() { 
	// functions is supposed to set lastTimer0Update to the exact technically correct value, even if we are already past that
	uint64_t diff = mcu->cpu.totalCycls - lastSet.Timer3Update;
	diff = (diff / getTimer3PrescDiv()) * getTimer3PrescDiv();
	lastSet.Timer3Update += diff;
}
uint64_t A32u4::DataSpace::cycsToNextTimerInt() {
	uint64_t amt = -1;
	if(data[Consts::TIMSK0] & (1 << Consts::TIMSK0_TOIE0)){ // timer0 Overflow
		uint8_t timer0 = data[DataSpace::Consts::TCNT0];
		uint64_t nextOverflow = lastSet.Timer0Update + (256-timer0)*getTimer0PrescDiv();
		uint64_t interruptIn = nextOverflow - mcu->cpu.totalCycls;
		amt = std::min(amt, interruptIn);
	}

	if(data[Consts::TIMSK3] & (1 << Consts::TIMSK3_OCIE3A) && !Timer3ATriggered){ // timer3 A match
		uint16_t timer3 = getWordRegRam_(Consts::TCNT3L);
		uint16_t target = getWordRegRam_(Consts::OCR3AL);
		uint64_t nextMatch = lastSet.Timer3Update + (uint16_t)(target-timer3)*getTimer3PrescDiv();
		uint64_t interruptIn = nextMatch - mcu->cpu.totalCycls;
		amt = std::min(amt, interruptIn);
	}
	return amt;
}


MCU_INLINE uint8_t& A32u4::DataSpace::getGPRegRef(regind_t ind) {
	A32U4_ASSERT_INRANGE(ind, 0, Consts::GPRs_size, return data[0], "General Purpouse Register Index out of bounds: %" PRIu8, ind);
	return data[ind];
}
MCU_INLINE uint8_t A32u4::DataSpace::getGPReg(regind_t ind) const {
	A32U4_ASSERT_INRANGE(ind, 0, Consts::GPRs_size, return 0, "General Purpouse Register Index out of bounds: %" PRIu8, ind);
	return data[ind];
}
MCU_INLINE void A32u4::DataSpace::setGPReg(regind_t ind, reg_t val) {
	A32U4_ASSERT_INRANGE(ind, 0, Consts::GPRs_size, return, "General Purpouse Register Index out of bounds: %" PRIu8, ind);
	data[ind] = val;
}

MCU_INLINE uint8_t A32u4::DataSpace::getGPReg_(regind_t ind) const {
	return data[ind];
}
MCU_INLINE void A32u4::DataSpace::setGPReg_(regind_t ind, reg_t val) {
	data[ind] = val;
}

