Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
void A32u4::DataSpace::update_Set(uint16_t Addr, uint8_t val, uint8_t oldVal) {
	switch (Addr) {
		case Consts::EECR:
			setEECR(val, oldVal);
			break;

		case Consts::PLLCSR:
			setPLLCSR(val, oldVal);
			break;

		case Consts::SPDR:
			setSPDR();
			break;

		case Consts::TCCR0B:
			setTCCR0B(val);
			break;

		case Consts::TIFR0:
			checkForIntr();
			break;

		case Consts::SREG:
			updateSREGCache();
			if((val & (1<<Consts::SREG_I)) && (data[Consts::TIFR0] & (1 << DataSpace::Consts::TIFR0_TOV0)))
				mcu->cpu.breakOutOfOptim = true; // we need to break out of Optimisation to check if an interrupt can now occur (Global Interrupt Enable)
			break;

		case Consts::TCNT0:
			markTimer0Update();
			if (val < oldVal) {
				mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
				mcu->cpu.breakOutOfOptim = true;
			}
			//mcu->debugger.halt();
			break;

		case Consts::ADCSRA:
			if (oldVal & (1 << Consts::ADCSRA_ADSC) && !(val & (1 << Consts::ADCSRA_ADSC))) { // ADCSRA_ADSC has been set to 0
				data[Consts::ADCSRA] &= ~(1 << 1 << Consts::ADCSRA_ADSC); // clear again => should have no effect
			}
			if (!(oldVal & (1 << Consts::ADCSRA_ADSC)) && (val & (1 << Consts::ADCSRA_ADSC))) { // ADCSRA_ADSC has been set to 1 => start conversion
				if (val & (1 << Consts::ADCSRA_ADEN)) { // check if adc is enabled
					lastSet.ADCSRA_ADSC = mcu->cpu.totalCycls;
				}
			}
			break;

		case Consts::PORTB: pinChange(ATmega32u4::PinChange_PORTB, oldVal, val); break;
		case Consts::PORTC: pinChange(ATmega32u4::PinChange_PORTC, oldVal, val); break;
		case Consts::PORTD: pinChange(ATmega32u4::PinChange_PORTD, oldVal, val); break;
		case Consts::PORTE: pinChange(ATmega32u4::PinChange_PORTE, oldVal, val); break;
		case Consts::PORTF: pinChange(ATmega32u4::PinChange_PORTF, oldVal, val); break;
	}
}

void A32u4::DataSpace::updateSREGCache() {
	uint8_t val = data[Consts::SREG];
	for (uint8_t i = 0; i < 8; i++) {
		sreg[i] = val & (1 << i);
	}
}
void A32u4::DataSpace::updateCache() {
	updateSREGCache();
}


uint16_t A32u4::DataSpace::getADCVal() {
	return 0;
}


void A32u4::DataSpace::setEECR(uint8_t val, uint8_t oldVal){
	if (val & (1 << Consts::EECR_EERE)) {
		data[Consts::EEDR] = eeprom[getWordRegRam(Consts::EEARL)];
		val = val & ~(1 << Consts::EECR_EERE); //idk if this should be done bc its not stated anywhere but its the only logical thing
		mcu->cpu.totalCycls += 4;
	}

	if ((val & (1 << Consts::EECR_EEMPE)) && !(oldVal & (1 << Consts::EECR_EEMPE))) {
		lastSet.EECR_EEMPE = mcu->cpu.totalCycls;
	}

	if (val & (1 << Consts::EECR_EEPE)) {
		if (data[Consts::EECR] & (1 << Consts::EECR_EEMPE)) {
			uint8_t mode = data[Consts::EECR] >> 4;
			uint16_t Addr = getWordRegRam(Consts::EEARL);

			A32U4_ASSERT_INRANGE2(Addr, 0, Consts::eeprom_size, return, "Eeprom addr out of bounds" MCU_ADDR_FORMAT);

			switch (mode) {
			case 0b00:
				eeprom[Addr] = data[Consts::EEDR];
				break;
			case 0b01:
				eeprom[Addr] = 0;
				break;
			case 0b10:
				eeprom[Addr] |= data[Consts::EEDR]; //idk if it actually works like that
				break;
			}

			// set EEPE to 0 to indicate being ready again
			data[Consts::EECR] &= ~(1 << Consts::EECR_EEPE);
		}
	}
}
void A32u4::DataSpace::setPLLCSR(uint8_t val, uint8_t oldVal) {
	if (val & (1 << Consts::PLLCSR_PLLE)) {
		if (!(oldVal & (1 << Consts::PLLCSR_PLLE))) { //if PLLE is 0 but should be 1
			lastSet.PLLCSR_PLLE = mcu->cpu.totalCycls;
		}
	}
	else {
		if (oldVal & (1 << Consts::PLLCSR_PLLE)) { //if PLLE is 1 but should be 0
			data[Consts::PLLCSR] &= ~(1 << Consts::PLLCSR_PLOCK); //clear PLOCK
		}
	}
}
void A32u4::DataSpace::setSPDR() {
	if(SPI_Byte_Callback)
		SPI_Byte_Callback(data[Consts::SPDR]);

	for (uint8_t i = 0; i < 8; i++) {
		//Set SCK High
		//Set MOSI to REF_SPDR&0b1
		data[Consts::SPDR] >>= 1;
		if (SCK_Callback != NULL) {
			SCK_Callback();
		}
		//Set SCK LOW
	}
	data[Consts::SPSR] |= (1 << Consts::SPSR_SPIF);

	//request Interrupt if SPIE set
}
void A32u4::DataSpace::setTCCR0B(uint8_t val) {
	mcu->cpu.breakOutOfOptim = true;
	//printf("SWITCH to div:%d\n", timers.getTimer0PrescDiv());
	lastSet.Timer0Update = mcu->cpu.totalCycls; // dont use mark here since it shouldnt align with previous overflows (since this is the start and there are no previous overflows)
	//printf("fmark at %llu\n", mcu->cpu.totalCycls);
}

void A32u4::DataSpace::pushByteToStack(uint8_t val) {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP, Consts::ISRAM_start, Consts::data_size, return, "Stack pointer while push Byte out of bounds: " MCU_ADDR_FORMAT);
	data[SP] = val;
	setSP(SP - 1);

#if MCU_INCLUDE_EXTRAS
#if MCU_RW_RECORD
	mcu->analytics.ramWrite(SP);
#endif
#endif
}
uint8_t A32u4::DataSpace::popByteFromStack() {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP+1, Consts::ISRAM_start, Consts::data_size, return 0, "Stack pointer while pop Byte out of bounds: " MCU_ADDR_FORMAT);
	uint8_t Byte = data[SP + 1];

#if MCU_INCLUDE_EXTRAS
	mcu->debugger.registerStackDec(SP + 1);

#if MCU_RW_RECORD
	mcu->analytics.ramRead(SP+1);
#endif
#endif

	setSP(SP + 1);

	return Byte;
}

void A32u4::DataSpace::pushAddrToStack(addrmcu_t Addr) {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP, Consts::ISRAM_start+1, Consts::data_size, return, "Stack pointer while push Addr out of bounds: " MCU_ADDR_FORMAT);
	data[SP] = (uint8_t)Addr; //maybe this should be SP-1 and SP-2
	data[SP - 1] = (uint8_t)(Addr >> 8);

#if MCU_INCLUDE_EXTRAS
	mcu->debugger.registerAddressBytes(SP);

#if MCU_RW_RECORD
	mcu->analytics.ramWrite(SP);
	mcu->analytics.ramWrite(SP-1);
#endif
#endif

	setSP(SP - 2);
}
addrmcu_t A32u4::DataSpace::popAddrFromStack() {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP+1, Consts::ISRAM_start, Consts::data_size-1, return 0, "Stack pointer while pop Addr out of bounds: " MCU_ADDR_FORMAT);
	uint16_t Addr = data[SP + 2];//maybe this should be SP-1 and SP-2 
	Addr |= ((uint16_t)data[SP + 1]) << 8;

#if MCU_INCLUDE_EXTRAS
	mcu->debugger.registerStackDec(SP + 2);

