Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
	sreg[DataSpace::Consts::SREG_Z] = res == 0;

	sreg[DataSpace::Consts::SREG_C] = 1;
#else
	bool V = 0;
	bool N = (res & 0b10000000) != 0;
	bool Z = res == 0;
	bool S = V ^ N;
	bool C = 1;

	uint8_t val = 0;
	if (V) {
		val |= 1 << DataSpace::Consts::SREG_V;
	}
	if (N) {
		val |= 1 << DataSpace::Consts::SREG_N;
	}
	if (Z) {
		val |= 1 << DataSpace::Consts::SREG_Z;
	}
	if (S) {
		val |= 1 << DataSpace::Consts::SREG_S;
	}
	if (C) {
		val |= 1 << DataSpace::Consts::SREG_C;
	}

	uint8_t& reg = getByteRefAtAddr(DataSpace::Consts::SREG);
	reg = (reg & 0b11100000) | val;
#endif
}

void A32u4::DataSpace::setFlags_SVNZC_ADD_16(uint16_t a, uint16_t b, uint16_t res) {
#if FAST_FLAGSET
	uint16_t sum16 = a + b;
	uint32_t sum32 = a + b;
	bool V;
	sreg[DataSpace::Consts::SREG_V] = V = sum16 != sum32;

	bool R15 = isBitSet(res, 15);
	bool N;
	sreg[DataSpace::Consts::SREG_N] = N = R15;

	sreg[DataSpace::Consts::SREG_S] = N != V;

	sreg[DataSpace::Consts::SREG_Z] = res == 0;

	bool ah7 = isBitSet(a, 7 + 8);

	sreg[DataSpace::Consts::SREG_C] = !R15 && ah7;
#else
	bool ah7 = isBitSet(a, 7 + 8); //bit 7 of high byte of a word
	bool R15 = isBitSet(res, 15);

	uint16_t sum16 = a + b;
	uint32_t sum32 = a + b;
	bool V = sum16 != sum32;
	//bool V = ah7 && R15;
	bool N = R15;
	bool Z = res == 0;
	bool S = V ^ N;
	bool C = !R15 && ah7;

	uint8_t val = 0;
	if (V) {
		val |= 1 << DataSpace::Consts::SREG_V;
	}
	if (N) {
		val |= 1 << DataSpace::Consts::SREG_N;
}
	if (Z) {
		val |= 1 << DataSpace::Consts::SREG_Z;
	}
	if (S) {
		val |= 1 << DataSpace::Consts::SREG_S;
	}
	if (C) {
		val |= 1 << DataSpace::Consts::SREG_C;
	}

	uint8_t& reg = getByteRefAtAddr(DataSpace::Consts::SREG);
	reg = (reg & 0b11100000) | val;
#endif
}
void A32u4::DataSpace::setFlags_SVNZC_SUB_16(uint16_t a, uint16_t b, uint16_t res) {
#if FAST_FLAGSET
	int16_t sub16 = (int16_t)a - (int16_t)b;
	int32_t sub32 = (int16_t)a - (int16_t)b;
	bool V;
	sreg[DataSpace::Consts::SREG_V] = V = sub16 != sub32;

	bool R15 = isBitSet(res, 15);
	bool N;
	sreg[DataSpace::Consts::SREG_N] = N = R15;

	sreg[DataSpace::Consts::SREG_S] = N != V;

	sreg[DataSpace::Consts::SREG_Z] = res == 0;

	sreg[DataSpace::Consts::SREG_C] = b > a;
#else
	bool R15 = isBitSet(res, 15);

	int16_t sub16 = (int16_t)a - (int16_t)b;
	int32_t sub32 = (int16_t)a - (int16_t)b;
	bool V = sub16 != sub32;
	//bool V = R15 && !ah7;// had ah7 && R15; but seems to be wrong
	bool N = R15;
	bool Z = res == 0;
	bool S = V ^ N;
	//bool S = (int16_t)a < (int16_t)b;
	bool C = b > a;//had R15 && !ah7 before but seems to be wrong

	uint8_t val = 0;

	val |= V << DataSpace::Consts::SREG_V;
	val |= N << DataSpace::Consts::SREG_N;
	val |= Z << DataSpace::Consts::SREG_Z;
	val |= S << DataSpace::Consts::SREG_S;
	val |= C << DataSpace::Consts::SREG_C;

	uint8_t& reg = getByteRefAtAddr(DataSpace::Consts::SREG);
	reg = (reg & 0b11100000) | val;
#endif
}
#endif

void A32u4::DataSpace::loadDataFromMemory(const uint8_t* data_, size_t len) {
	std::memcpy(data, data_, std::min((size_t)Consts::data_size, len));
	updateCache();
}

void A32u4::DataSpace::getState(std::ostream& output){
	update_Get(0xFFFF, false);

	getRamState(output);
	getEepromState(output);

	StreamUtils::write(output, lastSet.EECR_EEMPE);
	StreamUtils::write(output, lastSet.PLLCSR_PLLE);
	StreamUtils::write(output, lastSet.ADCSRA_ADSC);
	StreamUtils::write(output, lastSet.Timer0Update);
#if MCU_WRITE_HASH
	StreamUtils::write(output, hash());
#endif
}
void A32u4::DataSpace::setState(std::istream& input){
	setRamState(input);
	setEepromState(input);

	StreamUtils::read(input, &lastSet.EECR_EEMPE);
	StreamUtils::read(input, &lastSet.PLLCSR_PLLE);
	StreamUtils::read(input, &lastSet.ADCSRA_ADSC);
	StreamUtils::read(input, &lastSet.Timer0Update);
	A32U4_CHECK_HASH("DataSpace");
}

void A32u4::DataSpace::getRamState(std::ostream& output){
	output.write((const char*)data, Consts::data_size);
}
void A32u4::DataSpace::setRamState(std::istream& input){
	input.read((char*)data, Consts::data_size);
	updateCache();
}
void A32u4::DataSpace::getEepromState(std::ostream& output){
	output.write((const char*)eeprom, Consts::eeprom_size);
}
void A32u4::DataSpace::setEepromState(std::istream& input){
	input.read((char*)eeprom, Consts::eeprom_size);
}

bool A32u4::DataSpace::operator==(const DataSpace& other) const{
#define _CMP_(x) (x==other.x)
	return std::memcmp(data,other.data,Consts::data_size) == 0 &&
		std::memcmp(eeprom,other.eeprom,Consts::eeprom_size) == 0 &&
		std::equal(sreg,sreg+8,other.sreg,[](uint8_t a,uint8_t b){
			return (!!a) == (!!b);
		}) &&
		_CMP_(lastSet);
#undef _CMP_
}

size_t A32u4::DataSpace::sizeBytes() const {
	size_t sum = 0;

	sum += sizeof(mcu);

	sum += Consts::data_size;
	sum += Consts::eeprom_size;
#if MCU_USE_HEAP
	sum += sizeof(data);
	sum += sizeof(eeprom);
#endif

	sum += sizeof(SCK_Callback);
	sum += sizeof(SPI_Byte_Callback);

	sum += sizeof(sreg);

	sum += lastSet.sizeBytes();

	return sum;
}
uint32_t A32u4::DataSpace::hash() const noexcept{
	uint32_t h = 0;
	DU_HASHCB(h, data, Consts::data_size);
	DU_HASHCB(h, eeprom, Consts::eeprom_size);
	{
		uint8_t buf[sizeof(sreg)];
		for(size_t i = 0; i<sizeof(sreg); i++)
			buf[i] = !!sreg[i];
		DU_HASHCB(h, buf, sizeof(sreg));
	}
	DU_HASH_COMB(h, lastSet.hash());
	return h;
}


/*

#if 0
	switch (timer0Presc) {
	case 2:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 8;
		break;
	case 3:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 64;
		break;
	case 4:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 256;
		break;
	case 5:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 1024;
		break;
	}
#endif


void A32u4::DataSpace::Timers::update() {
	abort();
#define USE_TIM0_CACHE 1

#if 1
#if USE_TIM0_CACHE
	if (getTimer0Presc() == 3) {
#else
	if ((mcu->dataspace.data[A32u4::DataSpace::Consts::TCCR0B] & 0b111) == 3) {
#endif
		goto fast_goto_64;
	}
#endif

	bool doTick;
#if USE_TIM0_CACHE
	switch (getTimer0Presc()) {
#else
	switch (mcu->dataspace.data[A32u4::DataSpace::Consts::TCCR0B] & 0b111) {
#endif
	case 0:
		doTick = false; break;
	case 1:
		doTick = true; break;
	case 2:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 8) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 8;
		break;
	case 3:
#if 1
		fast_goto_64:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 64) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 64;
#else
		{
			uint64_t val = mcu->cpu.totalCycls / 64;
			doTick = val != lastCounter;
			lastCounter = val;
		}
#endif
		break;
	case 4:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 256) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 256;
		break;
	case 5:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 1024) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 1024;
		break;
	default:
		abort();
	}

